server/common/models/AccountInfo.php

UPDATE `t_account_info` SET `login_ip`='127.0.0.1', `last_login_time`='1770896459' WHERE `uid`=3
---
    public function login($identity, $sendIp)
    {
        $this->updateAll([
            'login_ip' => $sendIp,
            'last_login_time' => time(),
        ], ['uid' => $identity->uid]);