server/common/models/News.php

    public function getClientNewsList($page = 1, $limit = 10, $fields = [])
    {

        // 如果缓存不存在，则执行数据库查询
        $where = [
            'and',
            ['=', 'type', 1]
        ];
        $list = $this->listFind(['page' => $page, 'row' => $limit])
            ->orderBy(['itime' => SORT_DESC])
            ->where($where)->asArray()->all();
---
SELECT * FROM `t_news` WHERE `type` = 1 ORDER BY `itime` DESC LIMIT 10