<?php

/**
 * x消息发送.
 *
 */

namespace common\helpers;

use Yii;
use common\helpers\HttpHelper;

/**
 * Currency Helper
 */
class RandName extends BaseHelper {

    /**
     * construct.
     *
     * @return void.
     */
    public function __construct() {
        
    }

    /**
     * 获取随机昵称
     * @param type $startUrl
     * @return type
     */
    public static function RandUidName() {

        return self::namelist();
    }

    public static function namelist() {
        $data = [
            '沙漠玫瑰',
            '封魔剑魂',
            '含羞蓓蕾',
            '腕豪',
            '残月之肃',
            '涤魂圣枪',
            '元素女皇',
            '魔法猫咪',
            '解脱者',
            '万花通灵',
            '血港鬼影',
            '虚空之女',
            '暮光星灵',
            '山隐之焰',
            '影流之镰',
            '逆羽',
            '幻翎',
            '青钢影',
            '翠神',
            '暴怒骑士',
            '岩雀',
            '铸星龙王',
            '戏命师',
            '海兽祭司',
            '永猎双子',
            '河流之王',
            '时间刺客',
            '星界游神',
            '虚空遁地兽',
            '复仇之矛',
            '沙漠皇帝',
            '迷失之牙',
            '弗雷尔卓德之心',
            '虚空之眼',
            '疾风剑豪',
            '暴走萝莉',
            '圣枪游侠',
            '暗裔剑魔',
            '冰霜女巫',
            '生化魔人',
            '德玛西亚之翼',
            '魂锁典狱长',
            '皮城执法官',
            '唤潮鲛姬',
            '影流之主',
            '蜘蛛女皇',
            '虚空掠夺者',
            '暗黑元首',
            '傲之追猎者',
            '皎月女神',
            '荆棘之兴',
            '未来守护者',
            '荣耀行刑官',
            '诺克萨斯之手',
            '惩戒之箭',
            '战争之影',
            '仙灵女巫',
            '无双剑姬',
            '深海泰坦',
            '爆破鬼才',
            '北地之怒',
            '机械先驱',
            '九尾妖狐',
            '不灭狂雷',
            '潮汐海灵',
            '龙血武姬',
            '法外狂徒',
            '远古巫灵',
            '放逐之刃',
            '刀锋之影',
            '水晶先锋',
            '齐天大圣',
            '曙光女神',
            '牧魂人',
            '发条魔灵',
            '暗夜猎手',
            '机械公敌',
            '复仇焰魂',
            '盲僧',
            '永恒梦魇',
            '德玛西亚皇子',
            '扭曲树精',
            '天启者',
            '荒漠屠夫',
            '皮城女警',
            '魔蛇之拥',
            '巨魔之王',
            '刀锋舞者',
            '诡术妖姬',
            '光辉女郎',
            '诺克萨斯统领',
            '琴瑟仙女',
            '赏金猎人',
            '无畏战车',
            '正义巨像',
            '猩红收割者',
            '德邦总管',
            '深渊巨口',
            '狂战士',
            '虚空先知',
            '离群之刺',
            '德玛西亚之力',
            '狂暴之心',
            '暮光之眼',
            '探险家',
            '铁铠冥魂',
            '酒桶',
            '不屈之枪',
            '圣锤之毅',
            '狂野女猎手',
            '兽灵行者',
            '大发明家',
            '恶魔小丑',
            '沙漠死神',
            '不祥之刃',
            '英勇投弹手',
            '祖安狂人',
            '熔岩巨兽',
            '风暴之怒',
            '蒸汽机器人',
            '海洋之灾',
            '瓦洛兰之盾',
            '虚空行者',
            '邪恶小法师',
            '冰晶凤凰',
            '披甲龙龟',
            '殇之木乃伊',
            '虚空恐惧',
            '死亡颂唱者',
            '瘟疫之源',
            '痛苦之拥',
            '蛮族之王',
            '时光守护者',
            '炼金术士',
            '堕落天使',
            '武器大师',
            '亡灵战神',
            '麦林炮手',
            '祖安怒兽',
            '无极剑圣',
            '符文法师',
            '众星之子',
            '雪原双子',
            '远古恐惧',
            '正义天使',
            '迅捷斥候',
            '战争女神',
            '卡牌大师',
            '牛头酋长',
            '寒冰射手',
            '黑暗之女'
        ];
        $count = rand(1, 148);
        if (!empty($data[$count]))
            return $data[$count];
        return '';
//        $count = rand(1, 50);//备用 一般用不着
//        return $data[$count];
    }

}
