server/backend/lib/ApiBaseController.php

SELECT * FROM `t_request_log` WHERE `id`=318
UPDATE `t_request_log` SET `response`='{\"code\":200,\"message\":\"success\",\"data\":{\"balance\":0,\"rechargeBalance\":0,\"pendingAmount\":0}}', `utime`=1770896460 WHERE `id`=318
---
    public function RecordResponse($data)
    {
        // 获取日志 ID
        $logId = Yii::$app->params['log_id'] ?? "";
        if ($logId) {
            // 查找之前保存的日志记录
            $log = RequestLog::findOne($logId);
            if ($log) {
                // 获取响应对象
                // 更新日志记录响应内容和状态码
                $log->response = json_encode($data);
                $log->utime = time();
                $log->save();  // 保存更新后的日志