server/backend/controllers/WalletController.php


        // 直接从支付配置表中获取满足金额区间、已启用的通道
        // 避免使用 PayConfig 中依赖 Redis 的方法（如 getRedisCacheOperation）
        $query = PayConfig::find()
            ->where([
                'type'          => 1,              // 启用
                'payConfigType' => $payConfigType, // 支付方式
            ])
            ->andWhere(['<=', 'minMoney', $amount])
            ->andWhere(['>=', 'maxMoney', $amount])
            ->andWhere([
                'or',
                ['payType' => $payType],
                ['payType' => 3],                  // 混合
            ])
            ->orderBy(['sort' => SORT_DESC]);
---
SELECT * FROM `t_pay_config` WHERE ((`type`=1) AND (`payConfigType`=2)) AND (`minMoney` <= 100) AND (`maxMoney` >= 100) AND ((`payType`=2) OR (`payType`=3)) ORDER BY `sort` DESC