server/common/components/ApiBearerAuth.php

INSERT INTO `t_user_login` (`uid`, `day`, `itime`, `utime`) VALUES (3, '2026-02-12', 1770896460, 1770896460)
---
    public function authenticate($user, $request, $response)
    {
        $authHeader = $request->getHeaders()->get('Authorization');
        if ($authHeader !== null) {
            if (preg_match('/^Bearer\s+(.*?)$/', $authHeader, $matches)) {
                $token = $matches[1];
                // 在这里添加你的自定义校验逻辑
                // 例如，从 Redis 或数据库中查找 token
                // 注意：确保你有一个方法来验证 token 的有效性
                // 根据 token 获取用户信息
                $identity = $this->GetToken($token);
                if ($identity != null) {
                    // 这里不再依赖 account_type 字段，避免老库无该字段时报 UnknownPropertyException
                    Yii::$app->user->login($identity);

                    //更新用户最后时间
                    $account = new AccountInfo();
                    $account->updateAll([
                        'login_ip' => $this->getUserIP(),
                        'last_login_time' => time(),
                    ], ['uid' => $identity->uid]);
                    //打日志
                    try {
                        Yii::$app->db->createCommand()->upsert(
                            't_user_login', // 表名
                            [
                                'uid' => $identity->uid,
                                'day' => date("Y-m-d"),
                                'itime' => time(),
                                'utime' => time(),
                            ], false
                        )->execute();

SELECT * FROM `t_account_info` WHERE `uid`=3
---
    protected function GetToken($token)
    {
        $uid = RedisHelper::getUidByAccessToken($token);
        if ($uid <= 0) {
            return false;
        }
        return AccountInfo::findOne(['uid' => $uid]);